# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"

brew "fzf"

brew "tmux"

# Install some other useful utilities like `sponge`.
#brew install moreutils
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
#brew install findutils
# Install GNU `sed`, overwriting the built-in `sed`.
#brew install gnu-sed --with-default-names

# Install `wget`
brew "wget"

# Install more recent versions of some macOS tools.
brew "vim"
brew "nvim"

# Install some CTF tools; see https://github.com/ctfs/write-ups.
# WiFi security
#brew install aircrack-ng
# Remove large files or passwords from git history
#brew install bfg
#brew install binutils
# Binwalk is a tool for searching a given binary image for embedded files and executable code
#brew install binwalk
# Classical cipher cracking
#brew install cifer
# TCP-over-DNS tunnel server and client
#brew install dns2tcp
# Zip password cracker
#brew install fcrackzip
# Foremost is a console program to recover files based on their headers, footers, and internal data structures
#brew install foremost
# A tool to exploit the hash length extension attack in various hashing algorithms.
#brew install hashpump
# Network logon cracker which supports many services
#brew install hydra
# Featureful UNIX password cracker
#brew install john
# Image manipulation
#brew install netpbm
# Port scanning utility for large networks
brew "nmap"
# Print info and check PNG, JNG, and MNG files
#brew install pngcheck
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
#brew install sqlmap
# TCP/IP packet demultiplexer
#brew install tcpflow
# Replay saved tcpdump files at arbitrary speeds
#brew install tcpreplay
# Analyze tcpdump output
#brew install tcptrace
# tcpserver and tcpclient are easy-to-use command-line tools for building TCP client-server applications.
#brew install ucspi-tcp # `tcpserver` etc.
# PDF viewer
#brew install xpdf
# General-purpose data compression with high compression ratio
#brew install xz

# Install other useful binaries.
cask "alacritty"
brew "bat"
brew "fasd"
brew "fd"
brew "git"
brew "git-lfs"
cask "ghostty"
brew "gron"
brew "htop"
brew "jq"
brew "mdless"
brew "mtr"
brew "node"
brew "nvm"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "rg"
brew "rlwrap"
brew "shellcheck"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "tokei"
brew "highlight"
brew "pbzip2"
brew "extract_url"

# Hammerspoon for great keyboard shortcuts as inspired by https://github.com/jasonrudolph/keyboard
cask "hammerspoon"

# dive - a tool for exploring a docker image, layer contents etc. https://github.com/wagoodman/dive
brew "dive"

brew "kubernetes-cli"
brew "kubectx"
brew "k9s"

